<template>
  <main class="page-shell role-sets-page ">
    <header class="page-heading">
      <h1>ゲームのルール</h1>
    </header>

    <h2>世界観</h2>
    <p>平和な村に人狼が紛れ込んでしまった。人狼は昼は村人に扮して生活し、夜な夜な村人を襲撃し食い荒らしてしまう。そこで村人たちは毎日会議を行い、怪しい人物を処刑していくのであった……。平和な村を取り戻すことはできるだろうか？</p>

    <h2>ゲームのルール</h2>
    通常の短期人狼です。ルールは続わかめて鯖に準拠しています。

    <h3>細かいルール</h3>
    <ul>
      <li>遺言呪殺(占い師が襲撃された日の呪殺)は発生します。</li>
      <li>狩人は連続護衛が可能です。</li>
      <li>投票最多多数は再投票です。決選投票はありません。4回の再投票で決着がつかなければ引き分けです。</li>
    </ul>

    <h3>続わかめて鯖との相違点</h3>
    <ul>
      <li>夜時間は固定です。人狼が襲撃タイミングを調整する必要はありません。役職実行時間は90～120秒程度を推奨します。</li>
      <li>このため、襲撃を実施した人狼は「最後に襲撃実行した人狼」となります。（猫又の挙動に影響します）</li>
      <li>夜時間に行動を実施しなかった役職はすべて突然死します。</li>
    </ul>

    <h3>NPC(初日犠牲者)について</h3>
    <ul>
      <li>初日に死亡するNPCです。人狼は1日目夜は初日犠牲者以外襲撃できません。</li>
      <li>人狼・妖狐・猫又以外の役職になる可能性があります。</li>
      <li>占い師を引いた場合、ランダムに占いを実行します。この結果、呪殺が発生する可能性があります。</li>
    </ul>

    <h2>サーバーのルール</h2>
    <h3>禁止事項</h3>
    <ul>
      <li><strong>人格否定・攻撃的な発言。</strong>画面の向こうに居るのは人間です。</li>
      <li><strong>戦略的突然死。</strong>突然死を戦略に組み込まないでください。</li>
      <li><strong>多窓(同一人物の2アカウント以上の参加)。</strong>他の参加者に対する冒涜的行為です。</li>
      <li><strong>システムメッセージのコピペ。</strong>騙り役職が用意しにくいため、禁止します。</li>
      <li><strong>ゲーム中の外部での他参加者との連絡。</strong>ゲーム崩壊に繋がります。ゲームに関係がなくともやめましょう。</li>
      <li><strong>消化村。</strong>放置でOKです。もちろん、人集まらなかったから方針変更はOK。</li>
    </ul>

    <h3>非推奨事項</h3>
    <ul>
      <li><strong>おはステ・完ステ。</strong>人狼は会話するゲームです。</li>
      <li><strong>野良村でのメタ推理。</strong>他の参加者に配慮しましょう。</li>
      <li><strong>村の掛け持ち。</strong>生きてる間は禁止です。死んだらOKです。</li>
    </ul>

    <h3>その他、村ごとの決め事</h3>
    <ul>
      <li><strong>村人の騙り。</strong>サーバーの推奨は「3人最終日の狼騙りのみOK」です。</li>
      <li><strong>初心者CO。</strong>サーバーは禁止しませんが、村ごとの指示に従ってください。</li>
      <li><strong>スマホからの参加。</strong>サーバーでは禁止しません。村ごとに決定してください。</li>
    </ul>
  </main>
</template>

<style scoped>
</style>
